tutorials/lagrangian/reactingParcelFoam/airRecirculationRoom/steady/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(roof|floor|sideWall|humanBody)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -1;
    }

    outlet
    {
        type            zeroGradient;
    }

    mouth
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -4;
    }

    "(intake1|intake2|intake3|intake4)"
    {
        type            zeroGradient;
    }

    "(exhaust_maxX|exhaust_minX|exhaust_maxY|exhaust_minY)"
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -2;
    }
}


// ************************************************************************* //
